performance/video_resource_get/staging/tsung.xml
<?xml version="1.0"?><tsung loglevel="info" dumptraffic="false">
<clients>
     <client host="localhost" use_controller_vm="true" maxusers="1000"/>
</clients>
<servers>
  <server host="amara.org" port="80" type="tcp"/>
</servers>
  <load>
   <arrivalphase phase="1" duration="60" unit="second">
    <users maxnumber="1000" interarrival="1" unit="minute"/>
   </arrivalphase>
  </load>

 <options>
  <option name="file_server" id="videos" value="/home/jed/.tsung/videos.csv"/>
 </options>
<sessions>
  <session name="VideosResource" probability="100" type="ts_http">

       <setdynvars sourcetype="file" fileid="videos" delimiter=";" order="iter">
        <var name="url"/>
        <var name="site_url"/>
        <var name="title"/>
        <var name="vid"/>
        <var name="duration"/>
       </setdynvars>
      <request subst="true">
      <http url="/api2/partners/videos/%%_vid%%/" method="GET">
            <http_header name="Content-Type" value="application/json"/>
            <http_header name="Accept" value="application/json"/>
            <http_header name="X-apikey" value="55edb393db4f1e7dc724ef847fa7b74f0af231cc"/>
            <http_header name="X-api-username" value="janetPCF"/>

      </http>
      </request>
</session>
</sessions>
</tsung>